app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = 1
---
    def index
        @docs= Doc.where(user_id: current_user)

INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Doc4"], ["content", "Testing Doc\r\n"], ["created_at", 2017-03-20 01:57:35 UTC], ["updated_at", 2017-03-20 01:57:35 UTC], ["user_id", 1]]
---
    def create
        @doc = current_user.docs.build(doc_params)

        if @doc.save

UPDATE "docs" SET "content" = ?, "updated_at" = ? WHERE "docs"."id" = ?  [["content", "lkjdslkfjdksljfklsjd lol"], ["updated_at", 2017-03-19 16:47:36 UTC], ["id", 2]]
---
    def update
        if @doc.update(doc_params)

SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def find_doc
            @doc = Doc.find(params[:id])